19-rails-associations/app/views/snacks/_snack_form.html.erb

SELECT "retailers".* FROM "retailers"
---
<%= f.label :retailer_id %>
<%= f.collection_select(:retailer_id, Retailer.all, :id, :name, prompt: true) %>