19-rails-associations/app/controllers/retailers_controller.rb

  def index
    @retailers = Retailer.all
---
SELECT "retailers".* FROM "retailers"