19-rails-associations/app/controllers/snacks_controller.rb

SELECT "snacks".* FROM "snacks"
---
    def index
        @snacks = Snack.all

INSERT INTO "snacks" ("name", "calories", "deliciousness", "created_at", "updated_at", "retailer_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Dosidos"], ["calories", 500], ["deliciousness", 5], ["created_at", "2018-05-22 17:40:56.393558"], ["updated_at", "2018-05-22 17:40:56.393558"], ["retailer_id", 2]]
---
    def create
        @snack = Snack.create(get_snack_params)

UPDATE "snacks" SET "deliciousness" = ?, "updated_at" = ? WHERE "snacks"."id" = ?  [["deliciousness", 9], ["updated_at", "2018-05-22 17:25:25.739217"], ["id", 1]]
---
    def update
        @snack.update(get_snack_params)

DELETE FROM "snacks" WHERE "snacks"."id" = ?  [["id", 5]]
---
    def destroy
        Snack.destroy(params[:id])

SELECT  "snacks".* FROM "snacks" WHERE "snacks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def find_snack
        @snack = Snack.find(params[:id])