20-rails-validations/app/controllers/retailers_controller.rb

SELECT "retailers".* FROM "retailers"
---
  def index
    @retailers = Retailer.all

INSERT INTO "retailers" ("name", "year_established", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "piuahefdgjla;sdfi"], ["year_established", 12], ["created_at", "2018-05-23 15:51:51.848279"], ["updated_at", "2018-05-23 15:51:51.848279"]]
---
  def create
    @retailer = Retailer.create(retailer_params)

SELECT  "retailers".* FROM "retailers" WHERE "retailers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    # byebug
    @retailer = Retailer.find(params[:id])