20-rails-validations/app/controllers/snacks_controller.rb

SELECT "snacks".* FROM "snacks"
---
    def index
        @snacks = Snack.all

INSERT INTO "snacks" ("name", "calories", "deliciousness", "created_at", "updated_at", "retailer_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Doritos"], ["calories", 5900], ["deliciousness", 1], ["created_at", "2018-05-22 20:01:45.502398"], ["updated_at", "2018-05-22 20:01:45.502398"], ["retailer_id", 8]]
---
    def create
        @snack = Snack.new(get_snack_params)
        if @snack.valid?
            @snack.save

UPDATE "snacks" SET "name" = ?, "deliciousness" = ?, "updated_at" = ? WHERE "snacks"."id" = ?  [["name", "Cheeto Poofs"], ["deliciousness", 2], ["updated_at", "2018-05-21 15:14:11.702874"], ["id", 3]]
---
    def update
        @snack.update(get_snack_params)

DELETE FROM "snacks" WHERE "snacks"."id" = ?  [["id", 9]]
---
    def destroy
        Snack.destroy(params[:id])

SELECT  "snacks".* FROM "snacks" WHERE "snacks"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def find_snack
        @snack = Snack.find(params[:id])