20-rails-validations/app/views/snacks/_snack_form.html.erb

SELECT "retailers".* FROM "retailers"
---
<%= f.select :deliciousness, (1..10) %>
<%= f.collection_select(:retailer_id, Retailer.all, :id, :name, prompt:true) %>